import { Dispatch, SetStateAction, useState } from "react";
import { AgreementInput } from "./AgreementInput";
import { Paragraph } from "./Paragraph";
import { FormFieldKey, FormValues } from "../-types";
import { FIELD_PLACEHOLDERS } from "../-constants";

function FormField({ name, form, setField }: {
  name: FormFieldKey;
  form: FormValues;
  setField: (key: FormFieldKey) => (v: string) => void;
}) {
  return (
    <AgreementInput
      value={form[name] ?? ""}
      onChange={setField(name)}
      placeholder={FIELD_PLACEHOLDERS[name]}
    />
  );
}

interface DocumentSectionProps {
  form: Partial<Record<FormFieldKey, string>>;
  setForm: Dispatch<SetStateAction<Partial<Record<FormFieldKey, string>>>>
}

export function DocumentSection({ form, setForm }: DocumentSectionProps) {
  const setField = (key: string) => (v: string) =>
    setForm(prev => ({ ...prev, [key]: v }))

  return (
    <section
      dir="rtl"
      className="border shadow flex flex-col gap-6 py-4 px-8 bg-gray-100/10 text-gray-200 font-faruma font-semibold md:text-xl rounded"
    >
      <Paragraph>
        މިއީ، މއ. އަސްޓްރަލް ބަހައިގެން ގ. ހިޔާ އަތިއްޔާ އަލީ އަށް ލިބުނު ބައިގައި ކޮށްފަހުރި އިމާރާތުގެ{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރި{" "}
        <FormField name="tenant_info" form={form} setField={setField} />
        {" "}އަށް ކުއްޔަށް (އެއް ރޫމް އެޕާޓްމަންތް ފްލެޓް) ދިނުމަށްކުރި އެގްރިމަންޓްއެކެވެ.
      </Paragraph>

      <Paragraph>
        1- މިއެގްރިމަންޓް އެކުލެވިގެންވަނީ 20 މާއްދާގެ މައްޗަށެވެ.
      </Paragraph>

      <Paragraph>
        2- މިއެގްރިމަންޓްގައި މީގެފަހުން "
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރި" އޭ ބުނެފަވަނީ، މއ. އަސްޓްރަލް ބަހައިގެން ގ. ހިޔާ އަތިއްޔާ ޢަލީ އަށް ލިބުނު ބައިގައި ކޮއްފަހުރި ޢިމާރާތުގެ{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރި (އެއްރޫމް އެޕާޓްމަންޓް ފްލެޓް) އަށެވެ. އަދި "ވެރިފަރާތް" އޭ ބުނެފަވަނީ ކުށްޔަށް ދޫކުރިފަރާތް ގ. ހިޔާ އަތިއްޔާ ޢަލީ (އޭ122280) އަށެވެ. އަދި "ކުއްޔަށްހިފި ފަރާތް" އޭ ބުނެފަވަނީ{" "}

        <FormField name="tenant_info" form={form} setField={setField} />
        {" "}އަށެވެ. އަދި "ޢިމާރާތް" އޭ ބުނެފަވަނީ، މއ. އަސްޓްރަލް ބަހައިގެން ގ. ހިޔާ އަތިއްޔާ ޢަލީ އަށް ލިބުނު ބައިގައި ކޮށްފަހުރި މުޅިއިމާރާތަށެވެ. އަދި "އެއްބަސްވުން" ބުނެފަވަނީ، އެއްވެސްފަރާތެއްގެ މަޖުބޫރު ކަމެއްނެތި ސަލާމަތް ބުއްދީގައިތިބެ، ކުއްޔަށްދޫކުރި ފަރާތާއި، ކުއްޔަށްހިފި ފަރާތް ވާހަކަދެކެވި މިދެފަރާތް ވެފައިވާ އެއްބަސްވުމަށެވެ.
      </Paragraph>

      <Paragraph>
        3-{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރި ވެރިފަރާތުން ކުއްޔަށް ހިފިފަރާތަށް ކުއްޔަށްދިން މުއްދަތަކީ، އެގްރީމަންޓްފެށޭތާރީހް ދުވަހުން ފެށިގެން އެގްރީމަންޓްނިމޭތާރީހް އަށެވެ. އެއީ މީލާދީ ގޮތުން {" "}
        <FormField name="agreement_duration" form={form} setField={setField} />
        {" "}އަހަރު ދުވަހެވެ.
      </Paragraph>

      <Paragraph>
        4- ވެރިފަރާތުން{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރި ކުއަޔަށް ހިފިފަރާތަށް ކުއްޔަށްދިނީ، ކޮންމެ މީލާދީމަހަކު{" "}
        <FormField name="rent_amount" form={form} setField={setField} />
        {" "}ގެ މަހަކު ކުއްޔަށެވެ.
      </Paragraph>

      <Paragraph>
        5- މިއެގްރިމެންޓްގައި ސޮއިކުރާއިރު ސެކިއުރިޓީ ފައިސާގެގޮތުގައި{" "}
        <FormField name="single_deposit" form={form} setField={setField} />
        {" "}ވެރިފަރާތައް ނުވަތަ ވެރިފަރާތުން ކަނޑައަޅާ ފަރާތަކާ ޙަވާލު ކުރަންވާނެއެވެ. މިސެކިއުރިޓީ ޑިޕޮސިޓް ފައިސާއަކީ ކުއްޔަށްހިފި ފަރާތް އެޕާޓްމަންޓް ދޫކޮދާއިރު ވެރިފަރާތައް ލިބިދާނެ ގެއްލުންތަކަށް ޙަރަދު ކުރުމަށް ބެހެއްޓޭ ފައިސާއެކެވެ. ސެކިއުރިޓީ ޑިޕޮސިޓް ފައިސާ ކުއްޔަށް ހިފިފަރާތަށް ދޫކުރެވޭނީ އެފަދަ ގެއްލުމެއް ލިބިފައިވާނަމަ އެޙަރަދު ކެނޑުމަށްފަހު ބާކީވާފައިސާއެވެ.
      </Paragraph>

      <Paragraph>
        6- މިއެގްރިމަންޓުގެ ހަތަރުވަނަ މާއްދާގައި ބަޔާންކޮށްފައިވާ މަހުކުލި، ކުއްޔަށް ހިފިފަރާތުން ވެރިފަރާތައް ދަށްކާނީ ކޮންމެ މީލާދީ މަހެއްގެ  10 ވަނަދުވަހުގެ ކުރިން ވެރިފަރާތް ނުވަތަ ވެރިފަރާތުން ކަނޑައަޅާ ފަރާތަކަށެވެ.
      </Paragraph>

      <Paragraph>
        7- ކުއްޔަށްހިފި ފަރާތުން{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރި ކުއްޔަށްހިފި މުއްދަތުގެ ތެރޭގައި، އެބުރީގައި ބޭނުންކުރާ ކަރަންޓް ބިލް، ފެން ބިލް އަދި މިނޫންވެސް އެ އެޕާޓްމަންޓްގައި ބޭނުންކުރާ އެފަދަ ބިލްތަކަށް ޤަވާއިދުން ފައިސާ ދައްކަން ޖެހޭނެއެވެ. އަދި ސަރުކާރުގެ އެކިފަރާތްތަކަށް{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރިން ދައްކަންޖެހޭ ޓެކްސް ފަދަ ހުރިހާ ބިލުތައްވެސް ދައްކާނީ ކުއްޔަށްހިފި ފަރާތުންނެވެ.
      </Paragraph>

      <Paragraph>
        8- އިމާރާތުގެ ސާފުތާހިރުކަން ހުރިނެތް މިންވަރު ބެލުމަށްޓަކައި މަހަކު އެއްފަހަރު{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރި އެތެރެއަށް ވެރިފަރާތް ނުވަތަ އެކަމަށްޓަކައި ވެރިފަރާތުން ކަނޑައަޅާ ފަރާތެއް ވަދެ ފާޙާނާއާއިއެކު ބެލުމުގެ ހުއްދަ، ކުއްޔަ ހިފިފަރާތުން ވެރިފަރާތައް ދޭންވާނެއެވެ. އަދި މިގޮތުން ބަލާބެލުމުގައި،{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރި ސާފުތާހިރުކަން ނެތުމުގެ ސަބަބުން ޢިމާރާތައް ގެއްލުމެއް ލިބިދާނެކަމަށް ވެރިފަރާތް ފާހަގަކުރާ ކަންކަތައް ކުއްޔަށްހިފި ފަރާތުން ރަނގަޅުކޮން އިޞްލާހު ކުރަންވާނެއެވެ.
      </Paragraph>

      <Paragraph>
        9- ޢިމާރާތުގެ ރައްކަލަށްޓަކައި، ޢިމާރާތުގެ އެއްވެސް ތަނެއް ތޮރުފާ އަދި މޮހޮރު ޖަހާ ހަދަންވާނީ ވެރިފަރާތަށް އެކަން އެނގުމަށްފަހު، ވެރިފަރާތުން އެކަމަށް ހުއްދަލިބިގެން، ވެރިފަރާތުން އެކަންކުރަން އަންގާގޮތަކަށެވެ.
      </Paragraph>

      <Paragraph>
        10-{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރީގައި (އެޕާޓްމަންޓްގައި) ހަރުކޮއްފައިހުރި އެއްވެސް އެއްޗަކައް އެއްވެސް ބާވަތެއްގެ ގެއްލުމެއް ލިބިއްޖެނަމަ ލަސްނުކޮށް ވެރިފަރާތައް އެކަން އަންގަން ވާނެއެވެ. އަދި އެފަދަ ގެއްލުމެއް މަރާމާތު ކުރަންވާނީ ވެރިފަރާތާއި މަޝްވަރާ ކުރުމަށްފަހު ވެރިފަރާތުން  އަންގާގޮތަކަށެވެ. އަދި ހަލާކުވީއެއްޗެއްގެ ބަދަލުގައި ބަދަލުކުރާ އެއްވެސްއެއްޗެއް، އިމާރާތްކުއްޔަށް ދިންއިރު ހުރި ކޮލިޓީ އަށްވުރެ ދަށްވެގެން ނުވާނެއެވެ.
      </Paragraph>

      <Paragraph>
        11-{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރީގެ ކުނިއާއި އަދި މިނޫންވެސް އެބާވަތުގެ އުކާލަންޖެހޭ ކުނިވާފަދަ ތަކެތި ބަހައްޓަންވާނީ ސިޑިގޮޅި ހަޑިނުވާ ގޮތަކަށް، ރަނގަޅަށް ޕެކްކޮފަ،{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރީގެ ދޮރުކުރިމަތީން ވެމްކޯގެ ޤަވާއިދުތަކާ އެއްގޮތް ވާގޮތުގެމަތިންނެވެ. އަދި ކުނިބަހަށްޓާ ސަރަހައްދުގެ ސާފުތާހިރުކަން ބެލެހެއްޓުމަކީ ކުއްޔަށް ހިފިފަރާތުގެ ޒިންމާއެކެވެ. ގުރައުންޑް ފްލޯގެ ގޯޅި ގަނޑުގައި ކުނިބެހެއްޓުމަކީ މަނާ ކަމެކެވެ.
      </Paragraph>

      <Paragraph>
        12- ކުއްޔަށްހިފި މުއްދަތުގެ ތެރޭގައި އިމާރާތުގައި އިސްލާމްދީނާއި، ދިވެހިރާއްޖޭގެ ޤާނޫނާއި ޙިލާފު އެއްވެސް ޢަމަލެއް ކުއްޔަށް ހިފިފަރާތުން ހިންގައިފިނަމަ އެކަމެއްގެ ފުރިހަމަ ޒިންމާ، ކުއްޔަށްހިފި ފަރާތުން އުފުލަން ޖެހޭނެއެވެ.
      </Paragraph>

      <Paragraph>
        13- ކުއްޔަށްހިފި ފަރާތުން އެހެން ފަރާތަކަށް{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރި ކުއްޔަށްދިނުމަކީ މަނާ ކަމެކެވެ.
      </Paragraph>

      <Paragraph>
        14- ކުއްޔަށްހިފި ފަރާތުން އެޕާޓްމަންޓް ދޫކޮށްލާނަމަ، ދެމަސް ދުވަސް ކުރިން ވެރިފަރާތައް އެކަން އަންގަންވާނެއެވެ.
      </Paragraph>

      <Paragraph>
        15- މިއެގްރިމަންޓްގައި އެއްބަސްވެފައިވާ ކަމެއްގެ އިތުރުން އެއްވެސް މައްސަލައެއް ދިމާވެއްޖެ ނަމަ އެ މައްސްލައެއް ފުރަތަމަ ޙައްލު ކުރާނީ ދެފަރާތް ވާހަކަދައްކާ ސުލްހަވެރިކޮށެވެ. އަދި މިގޮތުން އެމައްސަލައެއް ޙައްލު ނުވެއްޖެނަމަ ދެން އެމައަސަލައެއް ޙައްލުކުރާނީ ކަމާބެހޭ ފަރާތެއް މެދުވެރިކޮށެވެ.
      </Paragraph>

      <Paragraph>
        16- މިއެގްރިމެންޓްގެ މުއްދަތު ހަމަވުމަށްފަލު ވެރިފަރާތުން{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރި އެއްވެސް ފަރާތަކަށް ކުއްޔަށް ދޭނަމަ، ކުއްޔަށް ހިފި ފަރާތަށް އިސްކަންދޭންވާނެއެވެ.
      </Paragraph>

      <Paragraph>
        17- މި އެގްރިމަންޓްގެ ހަތަރުވަނަވަނަ މާއްދާގައި އެއްބަސްވެފައިވާ ކުލި، ކުއްޔަށް ހިފިފަރާތުން މި އެގްރިމަންޓްގެ ހަވަނަ މާއްދާއާއި އެއްގޮތައް ނުދައްކައިފި ނަމަ، މި އެގްރިމަންޓް ބާތިލުކުރުމުގެ ފުރިހަމަ އިޙްތިޔާރު ވެރިފަރާތަށް ލިބިގެންވެއެވެ.
      </Paragraph>

      <Paragraph>
        18- މި އެގްރިމަންޓްގެ ސަތާރަވަނަ މާއްދާގެ ދަށުން މި އެގްރިމަންޓް ބާތިލް ކުރިނަމަވެސް، ކުއްޔަށްހިފި ފަރާތުން{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރި ބޭނުންކުރި މުއްދަތަށް ވެރިފަރާތައް މިއެގްރިމަންޓްގެ ދެވަނަ މާއްދާގައި އެއްބަސްވި ކުލި ދައްކަން ޖެހޭނެއެވެ. އަދި ކުއްޔަށްހިފި ފަރާތުގެ ސަބަބުން އިމާރާތަށާއި{" "}
        <FormField name="floor_number" form={form} setField={setField} />
        ބުރި (އެޕާޓްމަންޓް) އަށް އެއްވެސް ގެއްލުމެއް ލިބިފައި ހުރިނަމަ އެކަމުގެ ޒިންމާ އުފުލުމައްފަހު، ކުއްޔަށްހިފި ފަރާތުން ވެރިފަރާތައް ބަދަލުދިނުމަށް އެއްބަސްވެއެވެ.
      </Paragraph>

      <Paragraph>
        19- ވެރިފަރާތް ނުވަތަ ކުއްޔަށްހިފި ފަރާތުންކުރެ ފަރާތެއް ނުވަތަ ދެފަރާތުންކުރެ އެއްވެސްފަރާތެއް ދުނިޔޭގައި ނެތިއްޖެނަމަ، ވެރިފަރާތާއި ކުއްޔަށްހިފި ފަރާތުގެ ވާރިސުންނަށް މި އެގްރިމަންޓްއަށް ޢަމަލުކުރުމަށް ވަސީޢަތްކުރަމެވެ.
      </Paragraph>

      <Paragraph>
        20- ވެރިފަރާތާއި ކުއްޔަށްހިފި ފަރާތް މިއެގްރިމަންޓުގައި ސޮއިކުރީ،  ސަލާމަތް ބުއްދީގައިތިބެ މި އެގްރިމެންޓްގައި ހިމަނާފަހުރި ހުރިހާ މާއްދާތަކެއް ކިޔާ އެއްބަސްވުމަށްފަހު، އެއްވެސް ފަރާތެއްގެ ނުފޫޒެއް އަދި މަޖުބޫރުކަމެއް ނެތި، އަންނަނިވި ދެ ހެކިންގެ ހާޒިރުގައެވެ.
      </Paragraph>

      <Paragraph>
        -----------------------------------------------------------------<br />
        ކުއްޔަށްހިފި ފަރާތް<br />
        ނަން:{" "}
        <FormField name="sig_tenant_name" form={form} setField={setField} />
        <br />
        ދާއިމީ އެޑްރެސް:{" "}
        <FormField name="sig_tenant_address" form={form} setField={setField} />
        <br />
        ދ.ރ.ކ. އައިޑީ ކާޑު ނަމްބަރު:{" "}
        <FormField name="sig_tenant_id" form={form} setField={setField} />
        <br />
        ފޯނު ނަމްބަރު:{" "}
        <FormField name="tenant_phone_number" form={form} setField={setField} />
        <br />
        -----------------------------------------------------------------<br />
      </Paragraph>
    </section>
  )
}
